![alt text](https://miro.medium.com/v2/resize:fit:626/0*hEgFw1yxm3UdBEh4)

#                             Problem 1


1. **Problem Statement:** The task is to write a SQL query that fetches all the duplicate records from a table. 

2. **Context:** This task is crucial in data management and data cleaning process. Duplicate records can cause inconsistency and can lead to inaccurate results during data analysis. The aim here is to identify such duplicate records for further actions like deletion or modification.

3. **Table Structure:** The problem is demonstrated using a simple table named "users" which represents user data. It has three fields: "user_id" (primary key), "user_name", and "email". 

    Here's a snippet of the table:
```
   
    | user_id | user_name | email           |
    |---------|-----------|-----------------|
    | 1       | Sumit     | sumit@gmail.com |
    | 2       | Reshma    | reshma@gmail.com|
    | 3       | Farhana   |farhana@gmail.com|
    | 4       | Robin     | robin@gmail.com |
    | 5       | Robin     | robin@gmail.com |
    
    
```

4. **Approach:** The approach is to use a subquery with the window function `ROW_NUMBER()`. This function assigns a unique row number to each row within the partition of a result set. The partition is defined by the `PARTITION BY` clause, and ordering is determined by the `ORDER BY` clause.

5. **Query:** The following SQL query is used to solve the problem:

    ```sql
    SELECT user_id, user_name, email
    FROM (
        SELECT *,
        ROW_NUMBER() OVER(PARTITION BY user_name, email) AS rn
        FROM users 
    ) a
    WHERE rn != 1;
    ```
6. **Explanation:** The query works by assigning a unique row number to each record within each partition of "user_name" and "email". Thus, for each set of duplicates, one record has a row number of 1, and the rest have a row number of 2, 3, and so on. The outer query then fetches only the records with a row number not equal to 1, thus fetching all duplicate records.

7. **Results:** The result of the query would be a list of all duplicate user records based on "user_name" and "email". In this case, it would return the duplicate entry for user 'Robin' with email 'robin@gmail.com'.

8. **Summary:** This SQL query successfully fetches all duplicate records from the "users" table. It demonstrates the use of window functions to effectively deal with duplicate data, a common problem in data management. This approach can be easily adapted to a wide range of scenarios and tables, making it a powerful tool in a data professional's arsenal.

In [24]:
%%sql
SELECT user_id, user_name, email
FROM (
    SELECT *,
           ROW_NUMBER() OVER(PARTITION BY user_name, email) AS rn
    FROM users 
) a
WHERE rn != 1;

 * mysql://root:***@127.0.0.1:3306/hundred
1 rows affected.

[(5, 'Robin', 'robin@gmail.com')]

# Problem 2

1. **Problem Statement:** We are tasked with writing a SQL query to fetch the details of the employees who earn either the highest or the lowest salary in their respective department. This query will help the HR department in understanding the salary distribution in each department and plan for compensation reviews.

2. **Context:** Understanding the salary distribution in each department is essential for management. It can help determine if the salary structure is fair and equitable, and it can also reveal any discrepancies that may need to be addressed.

3. **Table Structure:** The "employee" table we're working with has the following structure:

- emp_ID (Primary Key, Integer): The ID of the employee.
- emp_NAME (String): The name of the employee.
- DEPT_NAME (String): The department in which the employee works.
- SALARY (Integer): The salary of the employee.

4. **Approach:** To solve this problem, we will use the `DENSE_RANK()` function along with `OVER()` clause in SQL. This allows us to rank the employees within each department based on their salary. We will create two rankings - one for the highest salaries (ordered descending) and one for the lowest salaries (ordered ascending). Then, we will use a CASE statement to label each employee as either earning the "highest_salary" or the "lowest_salary" within their department. Finally, we will filter for employees who hold either of these labels.

5. **Query:** Here is the SQL query that solves this problem:

```sql
with cte1 as
(
select
  emp_id, emp_name, dept_name, salary,
case
  when highest_rk=1 then "highest_salary" 
  when lowest_rk=1 then "lowest_salary"
end as highest_or_lowest
from
(
select
  *,
  dense_rank() over(partition by dept_name order by salary desc ) as highest_rk,
  dense_rank() over(partition by dept_name order by salary  ) as lowest_rk
from employee
)a  
where highest_rk=1 or lowest_rk=1
)
select 
 *
from cte1;
```

6. **Explanation:** This query creates two ranking columns: `highest_rk` and `lowest_rk`. For each department, it ranks employees based on their salaries in descending and ascending order, respectively. Then, it labels each employee as having either the "highest_salary" or the "lowest_salary" if they are ranked as 1 in the respective ranking column. Finally, the query filters to include only the employees who have either of these labels.

7. **Results:** The output of the query will be a table showing details of employees who either earn the highest or lowest salary in each department. It includes their ID, name, department, salary, and whether they earn the highest or lowest salary in their department.

8. **Summary:** In conclusion, we have demonstrated how to write a SQL query that retrieves and labels employees based on whether they earn the highest or lowest salary in their department. This analysis could be valuable for HR or management, providing insights into the company's salary structure. We also showed how to wrap this query inside a stored procedure for flexibility and reusability.

In [45]:
%%sql
with cte1 as
(
select
  emp_id, emp_name, dept_name, salary,
case
  when highest_rk=1 then "highest_saalry" 
  when lowest_rk=1 then "lowest_salary"
end as higest_orlowest
from
(
select
  *,
  dense_rank() over(partition by dept_name order by salary desc ) as highest_rk,
  dense_rank() over(partition by dept_name order by salary  ) as lowest_rk
from employee
)a  
where highest_rk=1 or lowest_rk=1
)
select 
  *
from cte1

 * mysql://root:***@127.0.0.1:3306/hundred
11 rows affected.

[(113, 'Gautham', 'Admin', 2000, 'lowest_salary'),
 (120, 'Monica', 'Admin', 5000, 'highest_saalry'),
 (106, 'Rajesh', 'Finance', 5000, 'lowest_salary'),
 (104, 'Dorvin', 'Finance', 6500, 'highest_saalry'),
 (116, 'Satya', 'Finance', 6500, 'highest_saalry'),
 (102, 'Rajkumar', 'HR', 3000, 'lowest_salary'),
 (105, 'Rohit', 'HR', 3000, 'lowest_salary'),
 (114, 'Manisha', 'HR', 3000, 'lowest_salary'),
 (119, 'Cory', 'HR', 8000, 'highest_saalry'),
 (103, 'Akbar', 'IT', 4000, 'lowest_salary'),
 (124, 'Dheeraj', 'IT', 11000, 'highest_saalry')]

# Problem 3


**1. Problem Statement:** We have a task to find out all users who logged in consecutively 4 or more times from a table named `login_details`.

**2. Context:** In real-world applications such as system monitoring or user behavior analysis, we often need to track consecutive events, such as consecutive logins, to monitor usage patterns, detect potential threats, or provide personalized user experiences.

**3. Table Structure:** The `login_details` table is structured as follows:

- `login_id` (integer): a unique identifier for each login.
- `user_name` (string): the username of the person logging in.
- `login_date` (date): the date of the login.

Here is an example of data in the `login_details` table:

```sql
login_id | user_name | login_date
---------|-----------|------------
   101   | Michael   | current_date
   102   | James     | current_date
   ...   | ...       | ...
```

**4. Approach:** We will use a Common Table Expression (CTE) with a window function to count the number of logins for each user, and then filter out those who logged in 4 or more times consecutively.

**5. Query:**

```sql
WITH cte1 AS
(
  SELECT *,
    COUNT(*) OVER(PARTITION BY user_name) AS grp
  FROM login_details
)
SELECT DISTINCT user_name
FROM cte1
WHERE grp >=4
```

**6. Explanation:** This query first uses a window function `COUNT(*) OVER(PARTITION BY user_name)` to count the number of logins for each user. This calculation is done in the CTE `cte1`. Then, from `cte1`, it selects distinct user names where the count of logins is 4 or more.

**7. Results:** The output will be a list of user names who logged in consecutively 4 or more times.

**8. Summary:** This solution demonstrates the use of window functions and CTEs to solve a common type of problem in analyzing event sequences. This approach is not only applicable to login data but also can be used in many other scenarios such as analyzing transaction patterns or sequence of events in system logs.

In [46]:
%%sql 

with cte1 as
(
select 
  *,
  count(*) over(partition by user_name ) as grp
from login_details
)

select 
  distinct user_name
from cte1
where grp >=4

 * mysql://root:***@127.0.0.1:3306/hundred
2 rows affected.

[('James',), ('Stewart',)]

# Problem 4

1. **Problem Statement:** From the weather table, fetch all the records when London had extremely cold temperature for 3 consecutive days or more.

2. **Context:** This task simulates a scenario where you need to identify periods of extremely cold temperatures in London. By analyzing the weather data, you can determine the duration of such cold spells.

3. **Table Structure:**
   - Table Name: weather
   - Columns:
     - id: INT (Primary Key)
     - city: VARCHAR(50)
     - temperature: INT
     - day: DATE
```
   | id  | city   | temperature | day        |
   | --- | ------ | ----------- | ---------- |
   | 1   | London | -1          | 2021-01-01 |
   | 2   | London | -2          | 2021-01-02 |
   | 3   | London | 4           | 2021-01-03 |
   | 4   | London | 1           | 2021-01-04 |
   | 5   | London | -2          | 2021-01-05 |
   | 6   | London | -5          | 2021-01-06 |
   | 7   | London | -7          | 2021-01-07 |
   | 8   | London | 5           | 2021-01-08 |
   
```
4. **Approach:** The query uses common table expressions (CTEs) to break down the problem into smaller steps. It identifies consecutive days with extremely cold temperatures using window functions and conditional checks.

5. **Query:** The query is solved in a cell below.

6. **Explanation:**
   - The first CTE (`cte1`) assigns a NULL value to the `result` column if the temperature is not extremely cold (below 0). This helps identify consecutive days of extremely cold temperatures.
   - The second CTE (`cte2`) uses count() function and it creates a grouping column (`grp`) that changes whenever there is a break in consecutive days of extremely cold temperatures.
   - The main query filters the records and selects the records where the count is 3 or more, indicating at least 3 consecutive days of extremely cold temperatures.Also we used count(grp), for more clearity please go through the sql query step by step.

7. **Results:** The result of the query will include the records when London experienced extremely cold temperatures for 3 or more consecutive days.

8. **Summary:** This SQL query effectively identifies periods of extremely cold temperatures in London by analyzing the weather data. It demonstrates the use of CTEs and window functions to tackle complex conditions involving consecutive days.

In [49]:
%%sql 

with cte1 as
(
select
  *,
  case
    when temperature <0 then null else 1 
  end as result
from weather
)
,
cte2 as
(
select
  *
from
(
  select
    *,
    count(result) over(order by day) as grp
  from cte1
)a 
where result is null
)

select
  id, city, temperature,day
from
(
select
  *,
  count(*) over(partition by grp) as cnt
from cte2
)a  
where cnt>=3

 * mysql://root:***@127.0.0.1:3306/hundred
3 rows affected.

[(5, 'London', -2, datetime.date(2021, 1, 5)),
 (6, 'London', -5, datetime.date(2021, 1, 6)),
 (7, 'London', -7, datetime.date(2021, 1, 7))]

# Problem 5

1. **Problem Statement:** The task is to write a SQL query that fetches the histogram of specialties for unique physicians who have performed procedures but have never prescribed anything.

2. **Context:** This task involves analyzing data related to physicians, event categories, and patient treatments. The goal is to identify the specialties of physicians who have performed procedures but have never prescribed anything. This information can be useful for understanding the distribution of specialties among physicians in the given dataset.

3. **Table Structure:** Here are the table structures for the three tables involved:

   - `event_category` table:
     ```
     event_name (varchar(50))
     category (varchar(100))
     ```

   - `physician_speciality` table:
     ```
     physician_id (int)
     speciality (varchar(50))
     ```

   - `patient_treatment` table:
     ```
     patient_id (int)
     event_name (varchar(50))
     physician_id (int)
     ```

4. **Approach:** The approach involves joining the three tables (`event_category`, `physician_speciality`, and `patient_treatment`) using appropriate keys. We filter the records to include only procedures (not prescriptions) and then group the data by specialty. Finally, we count the number of distinct physicians for each specialty to generate the histogram.

5. **Query:** Please refer to the query in the next cell below.

6. **Explanation:** The query uses common table expressions (CTEs) to break down the problem into logical steps. 

   The first CTE (`cte1`) combines data from the `patient_treatment`, `physician_speciality`, and `event_category` tables          using join operations. It retrieves the `patient_id`, `event_name`, `physician_id`, `speciality`, and `category` columns.        This CTE essentially brings together the necessary information for further analysis.

   The second CTE (`cte2`) selects the `physician_id` from `cte1` but filters out any rows where the `category` is either '        Prescription' or 'Test'. This CTE is used to identify the physicians who have performed procedures but have not prescribed      anything.

   The third CTE (`cte3`) selects all columns (`*`) from `cte1` but limits the result set to only those records where the          physician_id` matches any `physician_id` present in `cte2`. This CTE ensures that we only consider physicians who have          performed procedures but have not prescribed anything.

   The final query selects the `speciality` column from `cte3` and performs a count of distinct `physician_id` values for each      unique specialty. The result is grouped by `speciality`, and the count is displayed as `cnt`.

7. **Results:** The result of the query will be a histogram showing the specialties of physicians who have performed procedures but have never prescribed anything, along with the count of distinct physicians for each specialty.

8. **Summary:** By executing this SQL query, we successfully generate the histogram of specialties for physicians who have performed procedures but have never prescribed anything. This information can provide insights into the distribution of specialties among physicians and highlight specific specialties that focus more on procedures rather than prescriptions.

In [50]:
%%sql

with cte1 as
(
select
  patient_treatment.patient_id, patient_treatment.event_name, patient_treatment.physician_id, speciality, category
from patient_treatment join physician_speciality on patient_treatment.physician_id =physician_speciality.physician_id join 
                       event_category on patient_treatment.event_name=event_category.event_name
)
,
cte2 as
(
select
  physician_id
from cte1
where category not in ('Prescription','Test')
)
,
cte3 as
(
select
  *
from cte1 where physician_id in (select physician_id from cte2)
)

select
  speciality, count(distinct physician_id) as cnt
from cte3
group by speciality

 * mysql://root:***@127.0.0.1:3306/hundred
2 rows affected.

[('Oncologist', 3), ('Radiologist', 1)]